; domain
(define (domain rescue-drone)

    (:requirements :strips :negative-preconditions)

    (:predicates
        (drone-location ?d) ; Represents that the drone is at location ?d
        (person-location ?p ?d) ; Represents that the person ?p is at location ?d
        (obstacle ?d) ; Represents that there is an obstacle at location ?d
        (safe-zone ?d) ; Represents that location ?d is the safe zone
        (adjacent ?d1 ?d2) ; Represents that locations ?d1 and ?d2 are adjacent
        (rescued ?p) ; Represents that the person p has been rescued and is now in the safe zone
        (on-drone ?p) ; Represents that the person p is on the drone
        (drone-occupied); represents that the drone is currently carrying someone
        (spot ?s) ; Represents a valid spot in the safe zone
        (free-spot ?s) ; Represents that the spot ?s in the safe zone is free
    )

    (:action move
        :parameters (?d1 ?d2)

        :precondition (and
            (adjacent ?d1 ?d2)
            (not (obstacle ?d2))
            (drone-location ?d1)
        )

        :effect (and
            (drone-location ?d2)
            (not (drone-location ?d1))
        )
    )

    (:action pick-up
        :parameters (?p ?d)

        :precondition (and
            (person-location ?p ?d)
            (not (rescued ?p))
            (drone-location ?d)
            (not (drone-occupied))
        )

        :effect (and
            (on-drone ?p)
            (not (person-location ?p ?d))
            (drone-occupied)
        ) ; Note the we don't consider the person position to be d after being picked up.
    )

    (:action drop-off
        :parameters (?p ?sd ?s) ; sd for safe-zone position, s for spot

        :precondition (and
            (on-drone ?p)
            (safe-zone ?sd)
            (drone-location ?sd)
            (free-spot ?s)
            (spot ?s)
        )

        :effect (and
            (rescued ?p)
            (not (on-drone ?p))
            (not (drone-occupied))
            (not (free-spot ?s))
        )
    )

    ; Free a spot in the safe zone
    (:action free-safe-zone
        :parameters (?s)

        :precondition (and
            (not (free-spot ?s))
            (spot ?s)
        )

        :effect (free-spot ?s)
    )
)

; problem
(define (problem rescue-drone-problem)
  (:domain rescue-drone)

  (:objects
    d1 d2 d3 d4 d5 d6 d7 d8 d9 ; Locations
    p1 p2 p3 ; Persones
    s1 s2 ; Spots
    )

  (:init
    (drone-location d1)
    (person-location p1 d2)
    (person-location p2 d9)
    (person-location p3 d4)
    (safe-zone d3)

    ;; Define adjacencies for a 3x3 grid
    (adjacent d1 d2)
    (adjacent d1 d4)

    (adjacent d2 d1)
    (adjacent d2 d3)
    (adjacent d2 d5)

    (adjacent d3 d2)
    (adjacent d3 d6)

    (adjacent d4 d1)
    (adjacent d4 d5)
    (adjacent d4 d7)

    (adjacent d5 d2)
    (adjacent d5 d4)
    (adjacent d5 d6)
    (adjacent d5 d8)

    (adjacent d6 d3)
    (adjacent d6 d5)
    (adjacent d6 d9)

    (adjacent d7 d4)
    (adjacent d7 d8)

    (adjacent d8 d5)
    (adjacent d8 d7)
    (adjacent d8 d9)

    (adjacent d9 d6)
    (adjacent d9 d8)

    ;; Safe-zone spots
    (spot s1)
    (spot s2)
    (free-spot s1)
    (free-spot s2)
  )

  (:goal
    (and
      (rescued p1)
      (rescued p2)
      (rescued p3)
    )
  )
)

; plan
1. (move d1 d4)
   deleted: (drone-location d1)
   added: (drone-location d4)
   goals met: 0 of 3
2. (pick-up p3 d4)
   deleted: (person-location p3 d4)
   added: (on-drone p3) (drone-occupied)
   goals met: 0 of 3
3. (move d4 d1)
   deleted: (drone-location d4)
   added: (drone-location d1)
   goals met: 0 of 3
4. (move d1 d2)
   deleted: (drone-location d1)
   added: (drone-location d2)
   goals met: 0 of 3
5. (move d2 d3)
   deleted: (drone-location d2)
   added: (drone-location d3)
   goals met: 0 of 3
6. (drop-off p3 d3 s1)
   deleted: (on-drone p3) (drone-occupied) (free-spot s1)
   added: (rescued p3)
   goals met: 1 of 3
7. (move d3 d6)
   deleted: (drone-location d3)
   added: (drone-location d6)
   goals met: 1 of 3
8. (move d6 d9)
   deleted: (drone-location d6)
   added: (drone-location d9)
   goals met: 1 of 3
9. (pick-up p2 d9)
   deleted: (person-location p2 d9)
   added: (on-drone p2) (drone-occupied)
   goals met: 1 of 3
10. (move d9 d6)
   deleted: (drone-location d9)
   added: (drone-location d6)
   goals met: 1 of 3
11. (move d6 d3)
   deleted: (drone-location d6)
   added: (drone-location d3)
   goals met: 1 of 3
12. (drop-off p2 d3 s2)
   deleted: (on-drone p2) (drone-occupied) (free-spot s2)
   added: (rescued p2)
   goals met: 2 of 3
13. (free-safe-zone s1)
   added: (free-spot s1)
   goals met: 2 of 3
14. (move d3 d2)
   deleted: (drone-location d3)
   added: (drone-location d2)
   goals met: 2 of 3
15. (pick-up p1 d2)
   deleted: (person-location p1 d2)
   added: (on-drone p1) (drone-occupied)
   goals met: 2 of 3
16. (move d2 d3)
   deleted: (drone-location d2)
   added: (drone-location d3)
   goals met: 2 of 3
17. (drop-off p1 d3 s1)
   deleted: (on-drone p1) (drone-occupied) (free-spot s1)
   added: (rescued p1)
   goals met: 3 of 3
